{
  "Customer Segments": [
    "Who are your most important customers?",
    "What are the customer archetypes you target?",
    "What are their demographics, behaviors, and needs?",
    "Are you focused on mass market or niche segments?",
    "Are there distinct groups with different needs?"
  ],
  "Value Propositions": [
    "What value do you deliver to customers?",
    "Which customer problems are you solving?",
    "What bundles of products/services are you offering?",
    "How do you differentiate from competitors?",
    "What specific pain points do you address?"
  ],
  "Channels": [
    "How do customers prefer to be reached?",
    "How are you reaching them now?",
    "How are your channels integrated?",
    "Which channels work best and are most cost-efficient?",
    "How do channels integrate with customer routines?"
  ],
  "Customer Relationships": [
    "What type of relationship does each segment expect?",
    "How are these relationships established and maintained?",
    "How costly are they?",
    "How do they integrate with the rest of your business model?",
    "How do you acquire, retain and grow customers?"
  ],
  "Revenue Streams": [
    "What value are customers willing to pay for?",
    "What and how do they currently pay?",
    "How would they prefer to pay?",
    "How much does each revenue stream contribute to overall revenue?",
    "What is your pricing strategy and model?"
  ],
  "Key Resources": [
    "What key resources do your value propositions require?",
    "What resources are needed for distribution channels?",
    "What resources are needed for customer relationships?",
    "What resources are needed for revenue streams?",
    "Which physical, intellectual, human, or financial assets are critical?"
  ],
  "Key Activities": [
    "What key activities do your value propositions require?",
    "What activities are needed for distribution channels?",
    "What activities are needed for customer relationships?",
    "What activities are needed for revenue streams?",
    "What are your production, problem-solving, or platform activities?"
  ],
  "Key Partnerships": [
    "Who are your key partners and suppliers?",
    "Which key resources are you acquiring from partners?",
    "Which key activities do partners perform?",
    "What strategic alliances do you have?",
    "What joint ventures or co-opetition relationships exist?"
  ],
  "Cost Structure": [
    "What are the most important costs in your business model?",
    "Which key resources are most expensive?",
    "Which key activities are most expensive?",
    "Is your business cost-driven or value-driven?",
    "What are your fixed vs variable costs?"
  ]
}